app/controllers/articles_controller.rb

  def index
  	@articles = Article.paginate(:page => params[:page], :per_page => 3, :order => "created_at DESC")
---
SELECT "articles".* FROM "articles" ORDER BY created_at DESC LIMIT 1 OFFSET 2
SELECT COUNT(*) FROM "articles"

  def show
  	@article = Article.find_by_id(params[:id])
    @comments = @article.comments.order("id desc")
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY id desc  [["article_id", 14]]

  def create
  	@article = Article.new(params_article)
  	if @article.save
---
INSERT INTO "articles" ("content", "created_at", "status", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "adfdsa"], ["created_at", Wed, 03 Dec 2014 08:55:00 UTC +00:00], ["status", "off"], ["title", "tes"], ["updated_at", Wed, 03 Dec 2014 08:55:00 UTC +00:00]]

  def update
  	@article = Article.find_by_id(params[:id])

  	 if @article.update(params_article)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1
UPDATE "articles" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "updated_at" = $4 WHERE "articles"."id" = 9  [["image_file_name", "background.jpg"], ["image_file_size", 124820], ["image_updated_at", Tue, 09 Dec 2014 09:52:27 UTC +00:00], ["updated_at", Tue, 09 Dec 2014 09:52:27 UTC +00:00]]

  def destroy
  	@article = Article.find_by_id(params[:id])

    if @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 4 LIMIT 1
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 4]]