app/controllers/comments_controller.rb

  def create
	respond_to do |format|
	    @comment = Comment.new(params_comment)
	    if @comment.save
			format.js {@comments = Article.find_by_id(params[:comment][:article_id]).comments.order("id desc")}
---
INSERT INTO "comments" ("article_id", "content", "created_at", "status", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 14 LIMIT 1
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1 ORDER BY id desc  [["article_id", 14]]