app/controllers/users_controller.rb

  def create
    @user = User.new(params_user)
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 10 Dec 2014 03:56:19 UTC +00:00], ["email", "teguhrizki@gmail.com"], ["password", "teguhrizki"], ["updated_at", Wed, 10 Dec 2014 03:56:19 UTC +00:00], ["username", "teguh"]]